<a href="https://colab.research.google.com/github/TLeahSpencer/DataManipulationWithPython/blob/master/Working_with_Variables_Spaces%2C_New_Lines.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import numpy as np
import pandas as pd

In [4]:
#Lets create a dataframe and a dictionary
#We know we are creating a dictionary because we see {Key : Values}
DATASAMPLES1 = pd.DataFrame({'Favorite Colors': ['Blue','green','yellow','orange'], 
                             'Favorite Hats': ['Puma','Converse','Lacoste','Hollister']},
                            index=[0,1,2,3]) #Organize our table

In [5]:
DATASAMPLES1

  Favorite Colors Favorite Hats
0            Blue          Puma
1           green      Converse
2          yellow       Lacoste
3          orange     Hollister

In [7]:
DATASAMPLES2 = pd.DataFrame({'Favorite Show': ['Billions', 'Startup', 'Curb your Enthusiasm'], 'Favorite Movies': ['Pans Labyrinth','I Walk the Line','Stardust']}, index=[0,1,2])

In [8]:
DATASAMPLES2

          Favorite Show  Favorite Movies
0              Billions   Pans Labyrinth
1               Startup  I Walk the Line
2  Curb your Enthusiasm         Stardust

In [10]:
#Lets combine those data samples into a list inside a new variable
DATASAMPLES = [DATASAMPLES1, DATASAMPLES2]

In [11]:
DATASAMPLES #This prints both sets of DATASAMPLES

[  Favorite Colors Favorite Hats
 0            Blue          Puma
 1           green      Converse
 2          yellow       Lacoste
 3          orange     Hollister,           Favorite Show  Favorite Movies
 0              Billions   Pans Labyrinth
 1               Startup  I Walk the Line
 2  Curb your Enthusiasm         Stardust]

In [12]:
DATASAMPLES1 #This lists the contents with DATASAMPLES1 variable

  Favorite Colors Favorite Hats
0            Blue          Puma
1           green      Converse
2          yellow       Lacoste
3          orange     Hollister

In [13]:
#Now lets combine these data sets into one table
TOTALDATA = pd.concat(DATASAMPLES)

In [14]:
TOTALDATA

  Favorite Colors Favorite Hats         Favorite Show  Favorite Movies
0            Blue          Puma                   NaN              NaN
1           green      Converse                   NaN              NaN
2          yellow       Lacoste                   NaN              NaN
3          orange     Hollister                   NaN              NaN
0             NaN           NaN              Billions   Pans Labyrinth
1             NaN           NaN               Startup  I Walk the Line
2             NaN           NaN  Curb your Enthusiasm         Stardust

In [17]:
DATASAMPLES3 = pd.DataFrame({'Favorite Cars': ['Mustang', 'Porsche', 'Lexus', 'Acura']}, index=[0,1,2,3])

In [18]:
DATASAMPLES3

  Favorite Cars
0       Mustang
1       Porsche
2         Lexus
3         Acura

In [19]:
DATASAMPLEFINAL = [DATASAMPLES1, DATASAMPLES2, DATASAMPLES3]

In [20]:
DATASAMPLEFINAL

[  Favorite Colors Favorite Hats
 0            Blue          Puma
 1           green      Converse
 2          yellow       Lacoste
 3          orange     Hollister,           Favorite Show  Favorite Movies
 0              Billions   Pans Labyrinth
 1               Startup  I Walk the Line
 2  Curb your Enthusiasm         Stardust,   Favorite Cars
 0       Mustang
 1       Porsche
 2         Lexus
 3         Acura]

In [21]:
TOTALDATA2 = pd.concat(DATASAMPLEFINAL)

In [22]:
TOTALDATA2

  Favorite Colors Favorite Hats  ...  Favorite Movies Favorite Cars
0            Blue          Puma  ...              NaN           NaN
1           green      Converse  ...              NaN           NaN
2          yellow       Lacoste  ...              NaN           NaN
3          orange     Hollister  ...              NaN           NaN
0             NaN           NaN  ...   Pans Labyrinth           NaN
1             NaN           NaN  ...  I Walk the Line           NaN
2             NaN           NaN  ...         Stardust           NaN
0             NaN           NaN  ...              NaN       Mustang
1             NaN           NaN  ...              NaN       Porsche
2             NaN           NaN  ...              NaN         Lexus
3             NaN           NaN  ...              NaN         Acura

[11 rows x 5 columns]

In [25]:
NEWTOTALDATA = pd.concat([DATASAMPLES1, DATASAMPLES2, DATASAMPLES3], axis=1).reindex(DATASAMPLES1.index)

In [26]:
NEWTOTALDATA

  Favorite Colors Favorite Hats  ...  Favorite Movies Favorite Cars
0            Blue          Puma  ...   Pans Labyrinth       Mustang
1           green      Converse  ...  I Walk the Line       Porsche
2          yellow       Lacoste  ...         Stardust         Lexus
3          orange     Hollister  ...              NaN         Acura

[4 rows x 5 columns]

In [27]:
#Now lets check for null and nan values
NEWTOTALDATA.isnull().values.any()

True

In [28]:
#Now lets check for null and nan values
NEWTOTALDATA.isna().values.any()

True

In [30]:
NEWTOTALDATA = NEWTOTALDATA.replace('NaN', ' ')

In [31]:
NEWTOTALDATA

  Favorite Colors Favorite Hats  ...  Favorite Movies Favorite Cars
0            Blue          Puma  ...   Pans Labyrinth       Mustang
1           green      Converse  ...  I Walk the Line       Porsche
2          yellow       Lacoste  ...         Stardust         Lexus
3          orange     Hollister  ...              NaN         Acura

[4 rows x 5 columns]

In [32]:
NEWTOTALDATA.fillna(0)

  Favorite Colors Favorite Hats  ...  Favorite Movies Favorite Cars
0            Blue          Puma  ...   Pans Labyrinth       Mustang
1           green      Converse  ...  I Walk the Line       Porsche
2          yellow       Lacoste  ...         Stardust         Lexus
3          orange     Hollister  ...                0         Acura

[4 rows x 5 columns]

In [34]:
NEWTOTALDATA.fillna("none") # the quickest way to replace Null/NaN values

  Favorite Colors Favorite Hats  ...  Favorite Movies Favorite Cars
0            Blue          Puma  ...   Pans Labyrinth       Mustang
1           green      Converse  ...  I Walk the Line       Porsche
2          yellow       Lacoste  ...         Stardust         Lexus
3          orange     Hollister  ...             none         Acura

[4 rows x 5 columns]